Show / Hide Table of Contents
Enum SecondOrderEffectMethodEc2
The type of method for calculation second order effect.
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum SecondOrderEffectMethodEc2
Fields
 Name |  Description
 NominalCurvature
The method based on nominal curvature. This method is primarily suitable for isolated members with constant normal force and a defined effective length.
 NominalStiffness
The following model may be used to estimate the nominal stiffness of slender compression members with arbitrary cross section.
 Improve this Doc
 View Source